/* 
   TrailerStrings.strings
   iMovieApp

   Created by Randy Ubillos on 5/13/09.
   Copyright 2009 Apple Computer, Inc.. All rights reserved.
 */

creditsFont					= "Futura Condensed Medium";
creditsFontSize				= "24";
creditsUpperOffset				= "-1";
creditsLowerOffset				= "1";

nonBreakSpace				= " ";
missingWord				= "•";
colon						= ":";

studioName					= "HighDef Films";
musicName					= "iTunes";
trailerHeadingFormat			= "%@ (%@)";

miscellaneous				= "Sekalaista";
printTrailer					= "Tulosta traileri...";
playTrailer					= "Katso traileri";
done						= "Valmis";
trailerCompleteTitle			= "Traileri valmis";
trailerCompleteMessage			= "Traileri on valmis katsottavaksi tai jaettavaksi.";
trailer						= "traileri";

outline					= "Yhteenveto";
storyboard					= "Kuvakäsikirjoitus";
shotList					= "Otosluettelo";

ITUNES					= "iTunes";
iTUNES					= "iTunes";

myName					= "Minä";

titleCasting					= "ROOLITUS\n";
titleMusic					= "MUSIIKKI";
titleCostumeDesigner			= "PUVUSTUS";
titleEditor					= "LEIKKAUS";
titleProductionDesigner			= "LAVASTUS";
titlePhotography				= "KUVAUS";
titleExecutiveProducer			= "TUOTTAJA";
titleWriter					= "KÄSI-\nKIRJOITUS";
titleDirector					= "OHJAUS";

ratingLine1					= "TÄMÄ";
ratingLine2					= " iMOVIE ";
ratingLine3					= "ON SALLITTU\n";
ratingLine4					= "KAIKENIKÄISILLE\n";

creditsLine1					= "_iMOVIE_JA_%@_ESITTÄVÄT";
/* if the user-entered value that follows the indefinite article begins (or ends) with any of the strings in creditsArticleRuleMatches (a comma-separated list, no spaces), then creditsAltArticle will be used next to the film's producer/production name and director's name. otherwise creditsDefaultArticle will be used. Example: "AN Edgar Doe PRODUCTION" or "A John Doe PRODUCTION." Set "creditsArticleRuleBeginOrEnd" to "end" to match against the end of the user-entered string, e.g. "LA PAULA" or "EL PAULO" */
creditsArticleRuleBeginOrEnd		= "begin";
creditsArticleRuleMatches		= "A,E,I,O,U,a,e,i,o,u";
creditsDefaultArticle			= " ";
creditsAltArticle				= " ";
creditsLine2					= "%1$@_%2$@_-TUOTANNON YHTEISTYÖSSÄ_iMOVIEN_KANSSA";
creditsLine3					= "%1$@_%2$@_-ELOKUVAN";
starring					= "PÄÄOSISSA   ";

missingMedia				= "Lähdeleike puuttuu: %@";

shotListHeaderFormat			= "%@ - 1 leike";
shotListHeaderFormatMany		= "%@ - %d leikettä";

medium					= "Puolikuva";
wide						= "Kokokuva";
landscape					= "Maisema";
group						= "Ryhmä";
action						= "Toimintaa";
closeup					= "Lähikuva";
twoShot					= "Kaksi ihmistä";
pet						= "Kotieläin";
everyone					= "Kaikki";
animal					= "Eläin";

fm						= "Kaksi ihmistä";

genderLabel					= "Sukupuoli:";
roleLabel					= "Hahmo:";
gender0					= "Mies";
gender1					= "Nainen";

cast						= "Näyttelijät";
details					= "Nimi ja ilmestymisajankohta";
studio						= "Studio";
credits					= "Lopputekstit";

movieLabel					= "Elokuvan nimi:";
dateLabel					= "Ilmestyy:";
yearLabel					= "Julkaisuvuosi:";
seasonLabel					= "Julkaisukausi:";

label						= "Mukana:";
label1						= "Näyttelijä 1:";
label2						= "Näyttelijä 2:";
label3						= "Näyttelijä 3:";
label4						= "Näyttelijä 4:";
label5						= "Näyttelijä 5:";
label6						= "Näyttelijä 6:";

replacementString				= "---";

castInfo					= "Näyttelijöitä: %@";
durationInfo					= "Kesto: %@";

castRange					= "%d-%d";
castNumber					= "%d";
castAny					= "rajattomasti";

insufficientContent				= "Leike ei ole riittävän pitkä.";
needToBeOptimized			= "Leike on optimoitava.\n\nLeikkeitä voidaan optimoida tapahtumaselaimessa valitsemalla Arkisto > Optimoi video.";

themes					= "Projektiteemat";
trailers					= "Elokuvatrailerit";

None						= "Ei teemaa";
PhotoAlbum					= "Kuva-albumi";
BulletinBoard				= "Ilmoitustaulu";
ComicBook					= "Sarjakuva";
Filmstrip					= "Filmiraita";
Scrapbook					= "Leikekirja";
News						= "Uutislähetys";

Blockbuster					= "Kassamagneetti";
EpicDrama					= "Eeppinen draama";
Documentary				= "Dokumentti";
Supernatural				= "Yliluonnollinen";
RomanticComedy				= "Romanttinen komedia";
Friendship					= "Ystävyys";
Holiday					= "Loma";
Action						= "Toiminta";
Adventure					= "Seikkailu";
FilmNoir					= "Film noir";
Pets						= "Kotieläimet";
Sports					= "Urheilu";
Travel					= "Matkailu";
Spy						= "Vakoilu";
Romance					= "Rakkaustarina";

// postscript name of font used in Trailer outline tab
trailerOutlineFont				= "Bradley Hand Bold";

// postscript name of font used in Romance
romanceFont					= "EdwardianScrITCTT";

// postscript name of font used in Supernatural
supernaturalFont				= "GoudyOldSty-Reg";

// postscript name of font used in Action
actionFont						= "Gaz-Transport";

// postscript name of font used in Sports
sportsFont						= "OctinTeam-Heavy";

// postscript name of font used in Film Noir
filmNoirFont						= "Flatbush-Bold";
